try{new Morris.Bar({
    element:"int-stands",
    data:[
        {x:"Расширенный вариант (версия SRS)",y:3 ,y1:0 },
        {x:"Основной вариант (версия SRS)",y: 7,y1: 0},
        {x:"Расширенный вариант (версия G4)",y: 2,y1:5 },
        {x:"Основной вариант (версия G4)",y:23 ,y1:29 },
        {x:"Отчет содержит Стандартные элементы отчетности из Руководства GRI ",y: 14,y1:15 },
        {x:"Международный стандарт интегрированной отчетности ",y: 17,y1:14 },
        {x:"Наличие информации об использовании стандарта взаимодействия с заинтересованными сторонами AA 1000 SES",y:13 ,y1: 16},
        {x:"Наличие информации об использовании стандарта по принципам подотчетности AA 1000 APS",y:6 ,y1: 7},
        {x:"Наличие информации об использовании других международных стандартов отчетности",y:5 ,y1: 5}
    ],
    xkey: 'x',
    ykeys: ['y','y1'],
    labels: ['2017','2016'],
    resize:true,
    axes:false
});
}catch(e){} try{new Morris.Bar({
    element:'nums',
    data:[
        {x:"Указание на внутреннюю нормативную базу организации в области публичной отчетности и раскрытия информации",y:38 ,y1:37 },
        {x:"Наличие собственной системы показателей публичной отчетности",y: 8,y1: 11},
        {x:"Закрепление ответственности за топ-менеджментом",y:22 ,y1:18 },
        {x:"Отражение в отчете информации о взаимодействии с заинтересованными сторонами в ходе подготовки отчета",y:35 ,y1:23 },
        {x:"Закрепление ответственности за структурным подразделением или иной постоянно действующей организационной единицей",y: 28,y1:25 },
        {x:"Закрепление ответственности за публичную отчетность в КПЭ ",y: 5,y1:4 },
        {x:"Наличие Комиссии (Совета, Собрания и пр.) заинтересованных сторон организации (Stakeholder Panel) и ее вовлеченность в деятельность по публичной отчетности",y: 9,y1:11 },
        {x:"Наличие планов по совершенствованию публичной отчетности",y:19 ,y1: 18},
    ],
    xkey: 'x',
    ykeys: ['y','y1'],
    labels: ['2017','2016'],
    resize:true,
    axes:false
});
}catch(e){} try{new Morris.Bar({
    element: "stakeholder",
    data:[
        {x:"Наличие информации о выполнении обязательств перед заинтересованными сторонами, взятых в предыдущем отчетном периоде",y:16 ,y1: 18},
        {x:"Описание процесса определения существенных аспектов отчета",y:37 ,y1:16 },
        {x:"Наличие перечня существенных аспектов отчета",y: 37,y1:44 },
        {x:"Включенность представителей основных заинтересованных сторон в процесс определения существенных аспектов",y:34 ,y1:43 },
    ],
    xkey: 'x',
    ykeys: ['y','y1'],
    labels: ['2017','2016'],
    resize:true,
    axes:false

});
}catch(e){} try{new Morris.Bar({
    element:"zaver",
    data:[
        {x:"Наличие заключения внутреннего контроля и аудита",y:11 ,y1: 16},
        {x:"Наличие заверенного независимым профессиональным аудитором варианта подготовки отчета в соответствии с Руководством GRI",y:16 ,y1: 14},
        {x:"Наличие заключения об общественном/стейкхолдерском заверении",y:15 ,y1:15 },
        {x:"Наличие заключения об общественном/экспертном заверении",y:12 ,y1: 14},
    ],
    xkey: 'x',
    ykeys: ['y','y1'],
    labels: ['2017','2016'],
    resize:true,
    axes:false
});
}catch(e){} try{new Morris.Bar({
    element: "udob",
    data: [
        {x: "Наличие электронного (интерактивного) отчета ", y: 28, y1: 27},
        {x: "Адаптивный дизайн", y: 19, y1: 20},
        {x: "Наличие отдельного приложения для мобильных устройств", y: 6, y1: 5},
        {x: "Наличие в отчетах ссылок на дополнительную информацию в других источниках", y: 47, y1: 49},
        {x: "Наличие в pdf-версии отчета гиперссылок на другие разделы этого отчета", y: 36, y1: 37},
        {x: "Наличие глоссария", y: 38, y1: 43},
        {x: "Наличие списка сокращений", y: 43, y1: 44},
    ],
    xkey: 'x',
    ykeys: ['y', 'y1'],
    labels: ['2017', '2016'],
    resize: true,
    axes:false
});
}catch(e){} try{new Morris.Bar({
    element:"kanals",
    data:[
        {x:"Наличие в отчете контактов службы, ответственной за коммуникацию по вопросам раскрытия информации",y: 46,y1:44 },
        {x:"Наличие официального аккаунта организации как минимум в одной из социальных сетей",y:46 ,y1:34 },
        {x:"Наличие на сайте форума, специальной платформы и/или иной специальной on-line формы взаимодействия с заинтересованными сторонами ",y:3 ,y1: 5},
    ],
    xkey: 'x',
    ykeys: ['y','y1'],
    labels: ['2017','2016'],
    resize:true,
    axes:false
});}catch(e){}
/*}catch(e){} try{}catch(e){} try{}catch(e){} try{}catch(e){} try{new Morris.Bar({
    element:"",
    data:[
        {x:"",y: ,y1: },
    ],
    xkey: 'x',
    ykeys: ['y','y1'],
    labels: ['2017','2016'],
    resize:true,
});*/